import PageTitle from "@/components/PageTitle";
import { Square } from "lucide-react";
import Image from "next/image";

export default function RegistrationProcess() {
  return (
    <div>
      <PageTitle
        title="নিবন্ধন প্রক্রিয়া"
        routes={["হোম", "নিবন্ধন প্রক্রিয়া"]}
      />

      <div className="w-full md:pl-4">
        {/* date and social media area */}
        <div className="mt-5 flex justify-between bg-red-40 border-b pb-2">
          <p className="text-[#2C2C2C] text-sm">
            আপডেট: ১৬ নভেম্বর ২০২৫, ১৬: ৪৮
          </p>

          <div className="flex gap-1.5">
            <Image
              src={"/icons/facebook.svg"}
              alt="facebook logo"
              {...imageProps}
            />
            <Image src={"/icons/x.svg"} alt="x logo" {...imageProps} />
            <Image src={"/icons/share.svg"} alt="share icon" {...imageProps} />
            <Image src={"/icons/print.svg"} alt="print icon" {...imageProps} />
          </div>
        </div>

        {sections.map((step) => {
          return (
            <div key={step?.title}>
              {/* Box Head */}
              <div className="flex justify-center">
                <div className="bg-[#F0FDF4] border border-[#BDF7D2] w-max mt-6 px-4 py-2 rounded">
                  <p className="font-semibold text-lg md:text-xl">
                    {step?.title}
                  </p>
                </div>
              </div>

              {/* Box Title */}

              {step?.subsections.map((section) => (
                <div key={section?.title} className="mt-4">
                  {section?.title && (
                    <p className="font-semibold md:text-lg mb-2">
                      {section?.title}
                    </p>
                  )}

                  <ul>
                    {section?.points?.map((point) => (
                      <li
                        key={point}
                        className={`text-sm text-[#111827] flex gap-2 py-0.5`}
                      >
                        <div className="h-3 w-3 shrink-0 flex items-center justify-center mt-1">
                          <Square className="fill-[#111827] stroke-0 rotate-45 h-2 w-2" />
                        </div>
                        <span>{point}</span>
                      </li>
                    ))}
                  </ul>
                </div>
              ))}
            </div>
          );
        })}
      </div>
    </div>
  );
}

const sections = [
  {
    title: "প্রথম ধাপ: তথ্য সংগ্রহ",
    subsections: [
      {
        title: "প্রাথমিক পর্ব",
        points: [
          "পূর্ববর্তী ভোটার তালিকার ভিত্তিতে মোট ভোটার সংখ্যার একটি প্রাথমিক প্রাক্কলন এলাকাভিত্তিক প্রণয়ন করা।",
          "এই প্রাক্কলনের ভিত্তিতে প্রয়োজনীয় সংখ্যক সহকারী রেজিস্ট্রেশন অফিসার, ৫জন তথ্য সংগ্রহকারীরর জন্য একজন সুপারভাইজার এবং ৩০০-৪০০ জন ভোটারের জন্য একজন তথ্য সংগ্রহকারী নিয়োগ করা।",
          "নিয়োগ প্রক্রিয়া চলাকালীন সময়ে বিভিন্ন গণমাধ্যম ব্যবহার করে জনগণকে সচেতন করা।",
          "স্থানীয় জনপ্রতিনিধি, স্থানীয় প্রশাসন, সিভিল সোসাইটি, ইত্যাদির প্রতিনিধিদের সম্পৃক্ত করে সমন্বয়ণ জোরদারের জন্য বিভিন্ন ধরণের কমিটি গঠণ করা।",
          "এলাকাভিত্তিক ডাটা এন্ট্রি অপারেটর, টিম লিডার ইত্যাদি নিয়োগকল্পে বিজ্ঞপ্তি প্রকাশ, প্রাপ্ত আবেদন বাছাইকরণ, পরীক্ষা গ্রহণ এবং তাদের নিয়োগ প্রদান।",
          "তথ্য সংগ্রহের জন্য ফরম-২ মুদ্রণ ও বিতরণ।",
          "খসড়া ভোটার তালিকা প্রণয়ন।",
          "তথ্য সংগ্রহকারীদের জন্য রেজিস্ট্রার খাতা, ভোটার স্লিপ তৈরী এবং স্ট্যাম্প প্যাড ক্রয়। ক্রয়কৃত মালামাল জেলা নির্বাচন কর্মকর্তার নিকট হস্তান্তর।",
          "জেলখানার ভোটারদের বিশেষ ব্যবস্থায় ভোটার করার ব্যবস্থা গ্রহণ।",
        ],
      },
      {
        title: "মধ্য পর্ব",
        points: [
          "সহকারী রেজিস্ট্রেশন অফিসারদের ১ দিনের ওরিয়েনটেশন প্রদান।",
          "সুপারভাইজার ও তথ্য সংগ্রহকারীদের ৩ দিনের প্রশিক্ষণ প্রদান।",
          "ডাটা এন্ট্রি অপারেটর ও টিম লিডারদের ৩-১০ দিনের প্রশিক্ষণ প্রদান।",
          "তথ্য সংগ্রহকারীদের ফরম-২ ও অন্যান্য মালামাল প্রদান।",
          "ছবি তোলা শুরুর অন্তত ৭-১০ দিন আগে তথ্য সংগ্রহকারী কর্তৃক বাড়ী বাড়ী গিয়ে ফরম-২ এ তথ্য সংগ্রহ করা। গুরুতর অসুস্থ ও প্রতিবন্দ্বীদের বিষয়ে বিস্তারিত তথ্য সংগ্রহ করে রেজিস্ট্রারে লিপিবদ্ধকরণ।",
          "সংগৃহ তথ্য সুপারভাইজারের নিকট হস্তান্তর করা এবং সুপারভাইজার কর্তৃক প্রাপ্ত তথ্য যাচাই করণ।",
          "সুপারভাইজার কর্তৃক যাচাইকৃত ফরমগুলো এআরও-এর নিকট হস্তান্তর করা এবং হস্তান্তর করা ফরমগুলো যাচাই করে এলাকাভিত্তিক একত্রীকরণ।",
          "সেনাবাহিনীর সহায়তায় নিবন্ধন কেন্দ্র ও উপজেলা বা থানা সার্ভার স্টেশন স্থাপন।",
          "এআরও কর্তৃক নিবন্ধন ফরমগুলো নিবন্ধন কেন্দ্রের টিম লিডারের নিকট হস্তান্তর।",
          "টিম লিডার কর্তৃক ছবি তোলার জন্য এআরওকে তারিখ, সময়, ও সংখ্যা জানানো। এআরও কর্তৃক সুপারভাইজারের মাধ্যমে তথ্য সংগ্রহকারীকে তা জানানো।",
          "স্লিপের মাধ্যমে তথ্য সংগ্রহকারী কর্তৃক ভোটারকে ছবি তোলার সময়, তারিখ ও কেন্দ্রের নাম জানানো।",
          "কেন্দ্রকে ছবি তোলার উপযোগীকরণ।",
        ],
      },
      {
        title: "শেষ পর্ব",
        points: [
          "নিবন্ধন কেন্দ্র ও সার্ভার স্টেশনকে অপারেশনাল করা।",
          "ল্যাপটপ, ওয়েবক্যাম, ফিংগার প্রিন্ট স্ক্যানার, ফটোকপি মেশিন, জেনারেটর ইত্যাদি সংগ্রহ ও স্থাপন।",
        ],
      },
    ],
  },
  {
    title: "দ্বিতীয় ধাপ: ফলাফল পুনর্মূল্যায়ন ও সংগ্রহ",
    subsections: [
      {
        title: "",
        points: [
          "নিবন্ধন কেন্দ্রে ফরম সংগ্রহ ও যাচাই।",
          "ল্যাপটপ ভিত্তিক ফরমগুলো ক্রমবিন্যাসকরণ।",
          "লগবহিতে ফরমগুলো এন্ট্রিকরণ।",
        ],
      },
    ],
  },
  {
    title: "তৃতীয় ধাপ: নিবন্ধন কেন্দ্রে তথ্য সংগ্রহ ও পরিচিতি যাচাই",
    subsections: [
      {
        title: "",
        points: [
          "ভোটারের কেন্দ্রে আগমন ও দায়িত্বপ্রাপ্ত ব্যক্তিকে স্লিপ হস্তান্তর।",
          "ফরম সংগ্রহকরণ ও ডাটা এন্ট্রি অপারেটরের নিকট গমণ।",
          "কেন্দ্রে অবস্থিত যাচাইকারী কর্তৃক ভোটারকে চিহ্নিত করণ।",
          "ডাটা এন্ট্রি অপারেটর কর্তৃক তথ্যাদি, ল্যাপটপে ধারণ (যদি আগে থেকে এন্ট্রি না করা থাকে)।",
          "ছবি, আংগুলের ছাপ, স্বাক্ষর গ্রহণ এবং প্রাপ্তি রশিদ হস্তান্তর",
          "কোন এন্ট্রি বাকি থাকলে বাকি এন্ট্রি ডাটা এন্ট্রি অপারেটর কর্তৃক পূরণ।",
          "প্রতিদিন ল্যাপটপের তথ্য দলনেতার নিকট হস্তান্তর এবং তাঁর মাধ্যমে উপজেলা সার্ভারে স্থানান্তর।",
        ],
      },
    ],
  },
];

const imageProps = { width: 22, height: 22 };
