import PageTitle from "@/components/PageTitle";
import NewsSidebar from "./components/NewsSidebar";
import Image from "next/image";
import DateAndSocialMedia from "@/components/DateAndSocialMedia";
import { InputGroup, InputGroupInput } from "@/components/ui/input-group";
import { roboto } from "@/app/layout";

export default function NewsDetails() {
  return (
    <div className="container mx-auto pt-6 pb-8">
      <div className="w-full">
        <div className="grid grid-cols-1 gap-4 md:grid-cols-[8.5fr_3.5fr] lg:grid-cols-[9fr_3fr]">
          <div className="w-full overflow-x-auto">
            <PageTitle
              title={
                "বাংলাদেশ নির্বাচন কমিশনের একমাত্র অফিশিয়াল ইউটিউব চ্যানেল"
              }
              routes={["হোম", "সাম্প্রতিক খবর"]}
            />

            <DateAndSocialMedia />

            {/* banner  */}
            <div className="w-full h-[200px] md:h-[250px] lg:h-[500px] relative mt-4">
              <Image
                src={"/images/ec2.jpg"}
                alt="cover photo"
                fill
                className="object-cover rounded-t-md"
              />
            </div>

            {/* headline */}
            <div className="py-2 px-4 text-[#374151] text-xs bg-[#F9FAFB]">
              <p>ইসির নিজস্ব ইউটিউব চ্যানেলে বক্তব্য রাখছেন উদ্দিন</p>
            </div>

            {/* news details text */}
            <div className="mt-8 md:px-10">
              <p className="text-sm">
                লোরেম ইপসাম ডলর সিট আমেট, কনসেকটেতুর অ্যাডিপিসিং এলিট—এই
                সুপরিচিত ডামি পাঠ্যের মূল উদ্দেশ্য হলো প্রদর্শনমূলক নকশা বা
                বিন্যাসকে নিখুঁতভাবে পরীক্ষা করা, যাতে প্রকৃত বিষয়বস্তু
                অনুপস্থিত থাকলেও দর্শক বা ব্যবহারকারী বুঝতে পারেন কীভাবে একটি
                সম্পূর্ণ পৃষ্ঠা, একটি অ্যাপের ইন্টারফেস বা একটি প্রিন্ট লেআউট
                দেখতে পারে। বাংলা অনুবাদ ও বিস্তৃত রূপে এই পাঠ্যটি একইভাবে কাজ
                করে, যেখানে শব্দগুলো এমনভাবে সাজানো হয় যেন তারা অর্থপূর্ণ, অথচ
                বাস্তবে কোনো নির্দিষ্ট বার্তা বহন করে না। এই ধরনের পাঠ্য ব্যবহার
                করার মাধ্যমে ডিজাইনাররা সম্পূর্ণ স্বাধীনভাবে নকশার অনুপাত,
                স্পেসিং, টাইপোগ্রাফি, প্যারাগ্রাফের দৈর্ঘ্য, বাক্যের গঠন ইত্যাদি
                যাচাই করতে পারেন।
              </p>
              <p className="text-sm mt-4">
                বহু শতাব্দী ধরে লোরেম ইপসাম ব্যবহার হয়ে আসছে কারণ এটি দেখতে
                বাস্তব ভাষার মতো হলেও এতে কোনো গভীর অর্থ নেই, যা নকশায়
                বিভ্রান্তি তৈরি করে না। বাংলা রূপেও সেই একই পদ্ধতি বজায় রাখা
                হয়েছে, যাতে পাঠক এটিকে পড়ে কোনো অর্থ খোঁজার চেষ্টা না করেন।
              </p>
              <p className="text-sm mt-4">
                এই বিস্তৃত সংস্করণটি মূল পাঠ্যের ভাব বজায় রেখে আরও নানা
                দৃষ্টিকোণ তৈরি করে। যেমন—যেখানে বলা হয় যে ডামি পাঠ্যটি সময় ও
                কল্পিত শ্রমের ওপর নির্ভর করে, সেখানে এখানে আরও বিস্তৃত করা
                হয়েছে যে এটি নকশার একটি মানসিক অনুশীলনও হতে পারে। ডিজাইনার যখন
                পাঠ্যকে স্থাপন করেন, তখন তার লক্ষ্য থাকে চলমান প্রকল্পের একটি
                নির্দিষ্ট কাঠামো তৈরি করা। সেই কাঠামোর ভেতরেই থাকে ছবির অবস্থান,
                শিরোনামের উচ্চতা, অনুচ্ছেদের প্রস্থ, এমনকি মার্জিনের সূক্ষ্ম
                বিন্যাসও।
              </p>
              <p className="text-sm mt-4">
                কখনো কখনো এই পাঠ্য ব্যবহারের মাধ্যমে ব্যবহারকারীর ইন্টারঅ্যাকশনও
                পরীক্ষা করা হয়। যেমন—দীর্ঘ প্যারাগ্রাফে স্ক্রোল করলে কেমন অনুভব
                হয়, লাইন স্পেসিং চোখে আরাম দেয় কি না, শব্দের ঘনত্বে ক্লান্তি
                আসে কি না, কিংবা ছোট ডিভাইসে পড়লে লেআউট সিকোয়েন্স কিভাবে বদলে
                যায়। এসব পরীক্ষার জন্যই চিরকাল লোরেম ইপসাম বা তার অনুবাদিত ডামি
                টেক্সট ব্যবহৃত হয়।
              </p>
              <p className="text-sm mt-4">
                এভাবে এই পাঠ্যটি আরও দীর্ঘ হচ্ছে, এবং এর প্রতিটি অংশই সেই একই
                উদ্দেশ্যের প্রতি অনুগত থাকছে— নকশাকে দেখানো, কোনো অর্থ দেওয়া
                নয়। বাংলায় প্রসারিত করার জন্য শব্দগুলোকে এমনভাবে সাজানো হয়েছে
                যাতে তারা পড়লে মনে হয় যেন এগুলো অর্থপূর্ণ হলেও প্রকৃতপক্ষে কোন
                কাহিনি, যুক্তি বা উপসংহার নেই। শব্দের ধারাবাহিকতা বজায় রেখে
                বাক্যগুলো তৈরি করা হয়েছে। প্রদর্শনমূলক পাঠ্যের এই বিস্তৃত
                ধারাটি ব্যবহার করা হয় মূলত তখনই যখন কোনো নকশা প্রকল্পে বাস্তব
                কনটেন্ট এখনো প্রস্তুত হয়নি। ডিজাইনাররা প্রায়ই বলেন যে পাঠ্য
                ছাড়া একটি লেআউট অর্ধেক অসম্পূর্ণ থেকে যায়, কারণ পাঠ্যই নকশার
                ভর ও ভারসাম্য নির্ধারণে মূল ভূমিকা পালন করে। এই কারণে লোরেম
                ইপসাম বা তার বাংলা সংস্করণ ডিজাইনের প্রথম ধাপে অপরিহার্য উপাদান
                হয়ে ওঠে। নকশার ফ্রেম গড়ে উঠতে থাকলে শব্দের ধারাবাহিকতা নীরবে
                তার অবদান রেখে যায় এবং পাঠক বা পর্যবেক্ষক বুঝতে পারে যে এই
                স্থানটি বাস্তব বিষয়বস্তুর জন্য নির্ধারিত।
              </p>
              <p className="text-sm mt-4">
                প্রসারিত বাংলা লোরেম ইপসামের এই অংশটিতে শব্দগুলো এমনভাবে সাজানো
                হয়েছে যেন এগুলোতে সামান্য অর্থের আভাস পাওয়া যায়, কিন্তু
                গভীরভাবে দেখলে বোঝা যায় এটি কেবল মাত্র একটি নকশা-পরীক্ষামূলক
                উপাদান। এখানে ব্যবহৃত বাক্যগুলো দেখতে স্বাভাবিক, শুনতে পরিচিত,
                কিন্তু কোনো তথ্য প্রদান করে না। অর্থহীনতার এই শিল্পটি লোরেম
                ইপসামের মূল সৌন্দর্য। অনুবাদিত রূপেও সেই সৌন্দর্য বজায় রাখতে
                হয় অত্যন্ত সতর্কভাবে, কারণ অনেক সময়ই বাংলা ভাষার স্বাভাবিক গঠন
                অনিচ্ছাকৃতভাবে বাস্তব বার্তা প্রকাশ করে ফেলতে পারে। তাই
                বাক্যগুলোকে লঘুভাবে ধোঁয়াটে করা হয়েছে, যাতে তারা মিশে থাকে
                একটি বিমূর্ততার মধ্যে।
              </p>
            </div>

            {/* comments area */}
            <div className="mt-8 md:px-6">
              <div className="px-4 py-3 bg-[#F9FAFB]">
                <p className="pb-2 border-b-2 border-[#009951] font-semibold">
                  6 মন্তব্য
                </p>

                {/* comment search */}
                <div className="flex gap-4 mt-8 items-center">
                  <Image
                    src={"/images/user.svg"}
                    alt="user"
                    width={30}
                    height={30}
                  />

                  <div className="w-full">
                    <InputGroup>
                      <InputGroupInput placeholder="অনুসন্ধান করুন ..." />
                    </InputGroup>
                  </div>
                </div>

                {/* comments contents */}
                <div className="mt-8">
                  {[...new Array(6)].map((_, i) => {
                    return (
                      <div key={i} className="mt-5 bg-red-20 flex gap-4">
                        <div>
                          <Image
                            src={"/images/user.svg"}
                            alt="user"
                            width={30}
                            height={30}
                          />
                        </div>

                        <div className="w-full">
                          <div
                            className={`${roboto.className} flex gap-2 items-center`}
                          >
                            <p className="font-semibold text-sm">
                              unknown name
                            </p>
                            <p className="text-[#5E5E5E] text-[10px]">
                              Yesterday at 11:07 AM
                            </p>
                          </div>

                          <p className="text-sm">
                            লোরেম ইপসাম ডলর সিট আমেট, কনসেকটেতুর অ্যাডিপিসিং
                            এলিট—এই সুপরিচিত ডামি পাঠ্যের মূল উদ্দেশ্য হলো
                            প্রদর্শনমূলক নকশা বা বিন্যাসকে নিখুঁতভাবে পরীক্ষা
                            করা
                          </p>
                        </div>
                      </div>
                    );
                  })}
                </div>
              </div>
            </div>
          </div>

          <div>
            <NewsSidebar />
          </div>
        </div>
      </div>
    </div>
  );
}
